
       IDENTIFICATION DIVISION.
           PROGRAM-ID. PROJECT2.
           AUTHOR.CHENGZHI YU, XIAOMEI LIN, YONGXIONG HUANG
           DATE-WRITTEN. 2020-7-18
           DATE-COMPILED. 2020-7-22
           
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT INVENT-FILE-IN
               ASSIGN TO "C:\USERS\YUCHE\INVENT.TXT"
               ORGANIZATION IS LINE SEQUENTIAL.
           SELECT SUPPLIER-FILE-IN
               ASSIGN TO "C:\USERS\YUCHE\SUPPLIERS.TXT"
               ORGANIZATION IS LINE SEQUENTIAL.
           SELECT INVENT-REPORT-OUT
               ASSIGN TO "C:\USERS\YUCHE\INVREPRT.TXT"
               ORGANIZATION IS LINE SEQUENTIAL.
           SELECT REORDER-REPORT-OUT
               ASSIGN TO "C:\USERS\YUCHE\REORDERREPORT.TXT"
               ORGANIZATION IS LINE SEQUENTIAL.
                      

       DATA DIVISION.
       FILE SECTION.
       FD INVENT-FILE-IN.
        01 INVEN-RECORD-IN.
           05 PART-NUMBER-IN           PIC 9(5).
           05 PART-NAME-IN             PIC X(20).
           05 QTY-ON-HAND-IN           PIC 9(3).
           05 UNIT-PRICE-IN            PIC 9(2)V99.
           05 SUPPLIER-CODE            PIC X(5).
           05 REORDER-POINT-IN         PIC 9(3).
       FD SUPPLIER-FILE-IN.
           01 SUPPLIER-RECORD-IN       PIC X(66).
       FD INVENT-REPORT-OUT.
           01 INVENT-RECORD-OUT        PIC X(100).
       FD REORDER-REPORT-OUT.
           01 REORDER-RECORD-OUT       PIC X(100).
           
       WORKING-STORAGE SECTION.
       01 SUPPLIER-INFO.
           05 SUPPLIER-TBL-DATA OCCURS 10 TIMES.
               10 SUPPLIER-CODE-TBL    PIC X(5).
               10 SUPPLIER-NAME-TBL    PIC X(15).
       01 INVENT-RECORD-HDR.
           05 FILLER PIC X(10) VALUE "PartNumber".
           05 FILLER PIC X(10)  VALUE SPACES.
           05 FILLER PIC X(8)  VALUE "PartName".
           05 FILLER PIC X(16) VALUE SPACES.
           05 FILLER PIC X(8)  VALUE "Quantity".
           05 FILLER PIC X(10)  VALUE SPACES.
           05 FILLER PIC X(5)  VALUE "Value".
           05 FILLER PIC X(4)  VALUE SPACES.
           
       01 INVENT-DETAIL.
           05 PART-NUMBER-OUT PIC ZZZZZZ9.
           05 FILLER          PIC X(14) VALUE SPACES.
           05 PART-NAME-OUT   PIC X(20).
           05 FILLER          PIC X(4) VALUE SPACES.
           05 QTY-ON-HAND-OUT PIC ZZZ9.
           05 FILLER          PIC X(12) VALUE SPACES.
           05 STOCK-VALUE-OUT PIC $ZZ,ZZZ.99.
       01 AUDIT-TRAIL.
           05 FILLER PIC X(11) VALUE "TOTAL VALUE".
           05 FILLER PIC X(2)  VALUE SPACES.
           05 TOTAL-VALUE-OUT  PIC $Z,ZZZ,ZZZ.99.
           05 FILLER PIC X(2)  VALUE SPACES.
           05 FILLER PIC X(4)  VALUE "READ".
           05 FILLER PIC X(2)  VALUE SPACES.
           05 READ-CTR PIC ZZZ9 VALUE ZERO.
           05 FILLER PIC X(2)  VALUE SPACES.
           05 FILLER PIC X(7)  VALUE "WRITTEN".
           05 FILLER PIC X(2)  VALUE SPACES.
           05 WRITE-CTR PIC ZZZ9 VALUE ZERO.
       01 VALUE-OUT-WS.
           05 STOCK-VALUE-WS  PIC 9(8).
           05 TOTAL-VALUE-WS  PIC 9(10) VALUE ZERO.
           05 WRITE-CTR-TOTAL PIC 9(4) VALUE ZERO.
           05 WRITE-CTR-WS    PIC 9(4) VALUE ZERO.
           05 READ-CTR-WS     PIC 9(4) VALUE ZERO.
       01 REORDER-RECORD-HDR.
           05 FILLER PIC X(11) VALUE "PartNumber".
           05 FILLER PIC X(4)  VALUE SPACES.
           05 FILLER PIC X(10)  VALUE "PartName".
           05 FILLER PIC X(5) VALUE SPACES.
           05 FILLER PIC X(15) VALUE "Re-orderPoint".
           05 FILLER PIC X(2)  VALUE SPACES.
           05 FILLER PIC X(20) VALUE "SupplierName".
       01 REORDER-DETAIL.
           05 PART-NUMBER-RE-OUT   PIC ZZZZZZ9.
           05 FILLER               PIC X(7) VALUE SPACES.
           05 PART-NAME-RE-OUT     PIC X(15).
           05 FILLER               PIC X(2) VALUE SPACES.
           05 REORDER-POINT-RE-OUT PIC ZZZZZZZ9.
           05 FILLER               PIC X(8) VALUE SPACES.
           05 SUPPLIER-NAME-RE-OUT PIC X(15).
           
       01 EOF-FLAG-CONTROL.
           05 EOF-FLAG PIC X(3)     VALUE "NO".
           05 EOF-TBL-FLAG PIC X(3) VALUE "NO".
           05 SUB PIC 9(2) VALUE 1.
           
       PROCEDURE DIVISION.
       100-PRODUCE-INVENT-REORDER-REPORT.
           PERFORM 200-INITIATE-SUPPLIER-TABLE.
           PERFORM 201-PRODUCE-INVENT-REPORT.
           PERFORM 202-PRODUCE-REORDER-REPORT.
           STOP RUN.
       200-INITIATE-SUPPLIER-TABLE.
           PERFORM 300-OPEN-SUPPLIER-FILE.
           PERFORM 301-INI-SUPPLIER-TBL.
           PERFORM 302-LOAD-SUPPLIER-TBL
           VARYING SUB FROM 1 BY 1
           UNTIL SUB > 10
           OR EOF-TBL-FLAG = "YES".
           PERFORM 303-CLOSE-SUPPLIER-FILE.
       300-OPEN-SUPPLIER-FILE.
           OPEN INPUT SUPPLIER-FILE-IN.
       301-INI-SUPPLIER-TBL.
           INITIALIZE SUPPLIER-INFO.
       302-LOAD-SUPPLIER-TBL.
           READ SUPPLIER-FILE-IN
           AT END MOVE "YES" TO EOF-TBL-FLAG
           NOT AT END MOVE SUPPLIER-RECORD-IN
           TO SUPPLIER-TBL-DATA(SUB).
       303-CLOSE-SUPPLIER-FILE.
       CLOSE SUPPLIER-FILE-IN.
           
       201-PRODUCE-INVENT-REPORT.
           PERFORM 304-INITIATE-INVENT-REPORT.
           PERFORM 305-PRODUCE-INVENT-RECORD UNTIL EOF-FLAG = "YES".
           PERFORM 306-TERMINATE-INVENT-REPORT.
       304-INITIATE-INVENT-REPORT.
           PERFORM 501-OPEN-INVENT-FILE.
           PERFORM 502-READ-INVENT-RECORD.
           PERFORM 503-WRITE-INVENT-COL-HDR.
       501-OPEN-INVENT-FILE.
           OPEN INPUT INVENT-FILE-IN
               OUTPUT INVENT-REPORT-OUT.
       502-READ-INVENT-RECORD.
           READ INVENT-FILE-IN
           AT END
           MOVE "YES" TO EOF-FLAG
           NOT AT END
           ADD 1 TO READ-CTR-WS.
           MOVE READ-CTR-WS TO READ-CTR.
           
       503-WRITE-INVENT-COL-HDR.
           WRITE INVENT-RECORD-OUT FROM INVENT-RECORD-HDR
               AFTER ADVANCING 4 LINES.
           MOVE SPACES TO INVENT-RECORD-OUT.
           WRITE INVENT-RECORD-OUT AFTER ADVANCING 1 LINES.
       
       305-PRODUCE-INVENT-RECORD.
           PERFORM 504-CALCULATE-INVENT-VALUE.
           PERFORM 505-CALCULATE-TOTAL-INVENT-VALUE.
           PERFORM 506-WRITE-INVENT-DETAIL.
           PERFORM 502-READ-INVENT-RECORD.
       504-CALCULATE-INVENT-VALUE.
           MULTIPLY QTY-ON-HAND-IN BY UNIT-PRICE-IN
               GIVING STOCK-VALUE-WS.
           MOVE STOCK-VALUE-WS TO STOCK-VALUE-OUT.
       
       505-CALCULATE-TOTAL-INVENT-VALUE.
           ADD STOCK-VALUE-WS TO TOTAL-VALUE-WS.
           MOVE TOTAL-VALUE-WS TO TOTAL-VALUE-OUT.
       506-WRITE-INVENT-DETAIL.
           MOVE PART-NUMBER-IN TO PART-NUMBER-OUT.
           MOVE PART-NAME-IN TO PART-NAME-OUT.
           MOVE QTY-ON-HAND-IN TO QTY-ON-HAND-OUT.
           WRITE INVENT-RECORD-OUT FROM INVENT-DETAIL.
       ADD 1 TO WRITE-CTR-WS.
       
           
       306-TERMINATE-INVENT-REPORT.
           PERFORM 507-WRITE-AUDIT-TRAIL.
           PERFORM 508-CLOSE-INVENT-FILES.             
       507-WRITE-AUDIT-TRAIL.
           MOVE SPACES
               TO INVENT-RECORD-OUT.
           ADD WRITE-CTR-WS TO WRITE-CTR-TOTAL.
           MOVE WRITE-CTR-TOTAL TO WRITE-CTR.
           WRITE INVENT-RECORD-OUT
               AFTER ADVANCING 1 LINES.
           WRITE INVENT-RECORD-OUT
               FROM AUDIT-TRAIL.
       508-CLOSE-INVENT-FILES.
           CLOSE INVENT-FILE-IN
                 INVENT-REPORT-OUT.
       202-PRODUCE-REORDER-REPORT.
           PERFORM 307-INITIATE-REORDER-REPORT.
           PERFORM 308-PRODUCE-REORDER-RECORD UNTIL EOF-FLAG = "YES".
           PERFORM 309-TERMINATE-REORDER-REPORT.
       307-INITIATE-REORDER-REPORT.
           PERFORM 509-OPEN-REORDER-FILE.
           PERFORM 510-INI-EOF-FLAG.
           PERFORM 502-READ-INVENT-RECORD.
           PERFORM 511-WRITE-REORDER-COL-HDR.
       509-OPEN-REORDER-FILE.
           OPEN INPUT INVENT-FILE-IN
                OUTPUT REORDER-REPORT-OUT.
       510-INI-EOF-FLAG.
           MOVE "NO" TO EOF-FLAG.
       511-WRITE-REORDER-COL-HDR.   
           WRITE REORDER-RECORD-OUT FROM REORDER-RECORD-HDR.
       308-PRODUCE-REORDER-RECORD.
           IF QTY-ON-HAND-IN < REORDER-POINT-IN
               PERFORM 512-SEARCH-SUPPLIER-NAME
                   VARYING SUB FROM 1 BY 1
               UNTIL SUB > 10
               OR EOF-TBL-FLAG = "YES"
           PERFORM 513-WRITE-REORDER-DETAIL.
           PERFORM 502-READ-INVENT-RECORD.
       512-SEARCH-SUPPLIER-NAME.
           IF SUPPLIER-CODE = SUPPLIER-CODE-TBL(SUB)
               MOVE SUPPLIER-NAME-TBL(SUB) TO SUPPLIER-NAME-RE-OUT.
       513-WRITE-REORDER-DETAIL.
           MOVE PART-NUMBER-IN TO PART-NUMBER-RE-OUT.
           MOVE PART-NAME-IN TO PART-NAME-RE-OUT.
           MOVE REORDER-POINT-IN TO REORDER-POINT-RE-OUT.
           WRITE REORDER-RECORD-OUT FROM REORDER-DETAIL.
       309-TERMINATE-REORDER-REPORT.
           CLOSE INVENT-FILE-IN
                 REORDER-REPORT-OUT.
           
           GOBACK.

       END PROGRAM PROJECT2.
